app/Controllers/Tugas.php

SELECT *
FROM `tugas`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `tugas`
---
    public function index()
    {
        $keyword = $this->request->getGet('keyword');
        $perPage = 10; // Jumlah data per halaman

        if ($keyword) {
            $tugas = $this->tugasModel->search($keyword, $perPage);
        } else {
            $tugas = $this->tugasModel->paginate($perPage);

SELECT *
FROM `tugas`
WHERE `tugas`.`id` = '2'
---
    public function edit($id)
    {
        $data['title']     = 'Edit tugas';
        $model = new TugasModel();
        $data['tugas'] = $model->find($id);